<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="content-type"
 content="text/html; charset=ISO-8859-1">
  <title>Perspectives et vues</title>
</head>
<body>
<h1>Perspectives et vues</h1>
<h2>D&eacute;finitions</h2>
<ul>
  <li>Jajuk est divis&eacute; en perspectives et en vues. Une
perspective est un ensemble de vues.</li>
  <li>Une perspective est une fa&ccedil;on d'appr&eacute;hender les
ressources g&eacute;r&eacute;es par Jajuk. Par exemple, vous &ecirc;tes
actuellement dans la perspective aide pour obtenir des informations et
vous utiliserez la perspective physique pour naviguer dans les disques,
r&eacute;pertoires, fichiers ou la perspective logique pour naviguer
dans les styles, auteurs, albums, morceaux.</li>
  <li>Une vue est une mani&egrave;re de pr&eacute;senter les
informations relatives &agrave; une perspective. Par exemple, vous
disposez &agrave; la fois de la vue arbre physique et table physique
dans la perspective physique.</li>
  <li>Il y a deux types de vues : les statiques ( commande, information
et perspectives ) qui sont pr&eacute;sentes dans toutes les
perspectives et les vues flottantes qui sont li&eacute;es &agrave; une
perspective. Notez qu'une m&ecirc;me vue peut se trouver dans plusieurs
perspectives ( la vue couverture par exemple ).</li>
  <li>Pour changer de perspective, cliquez sur la perspective de votre
choix dans la vue perspective&nbsp; ( voir la figure 02 ).<br>
  </li>
</ul>
<br>
<img style="width: 501px; height: 359px;" alt=""
 src="../../images/pav01.jpg"><br>
<br style="font-style: italic;">
<span style="font-style: italic;">Fig. 01 : vues</span><br>
<br>
&nbsp; <span style="font-weight: bold;">Vues statiques ( dans toutes
les perspectives ) :</span><br>
<br>
1- Vue commande : permet de faire des recherches rapides, de
contr&ocirc;ler le lecteur et le son, de naviguer dans l'historique, de
fixer les modes de lectures et d'acc&eacute;der aux fonctions
sp&eacute;ciales comme 'best of'.<br>
<br>
2- Vue perspectives : Permet de s&eacute;lectionner la perspective
courante( voir le paragraphe suivant )<br>
<br>
3- Vue information: Affiche des informations diverses sur le nom du
morceau en train d'&ecirc;tre jou&eacute;, la taille de la
s&eacute;lection, les dur&eacute;es, la position en % ...<br>
<br>
<br>
<span style="font-weight: bold;">Vues flottantes :</span><br
 style="font-weight: bold;">
<br>
4- Ceci est un exemple de vue flottante ( la vue &eacute;diteur de
playliste physique ) que vous ne trouvez que dans la perspective
physique.<br>
<h2>Perspectives Jajuk</h2>
La version actuelle de Jajuk comprend cinq perspectives&nbsp; :<br>
<br>
<img style="width: 300px; height: 300px;" alt=""
 src="../../images/pav02.jpg"><br>
<span style="font-style: italic;">Fig. 02 : perspectives</span><br>
<br>
1- Perspective physique : Dans cette perspective, vous voyez votre
collection comme elle se trouve sur vos disques : fichiers,
r&eacute;pertoires, fichiers m3u etc...&nbsp; Toutes les actions se
font sur un fichier physique identifi&eacute;. Cette perspective est
utile mais poss&egrave;de un inconv&eacute;nient : si vous avez
plusieurs fois le m&ecirc;me morceau dans plusieurs supports ( par
exemple, un sur votre disque dur et un autre sur un CD ),
vous le verrez en double dans toutes les vues physiques. Idem pour les
playlistes.<br>
<br>
2- Perspective logique : Dans cette perspective, vous voyez votre
collection selon les tags id3 : styles, auteurs, albums, morceaux et
playlistes logiques ( une playliste logique associe plusieurs fichiers
playlistes ). Cette perspective n'est utile que si votre collection est
correctement tagu&eacute;e, sinon, tout sera 'inconnu'. Contrairement
&agrave; la playliste physique, vous avez maintenant des morceaux, plus
des fichiers. Un morceau est une association logique avec un ou
plusieurs fichiers. Cela signifie que vous ne verrez qu'un seul morceau
m&ecirc;me s'il est associ&eacute; &agrave; plusieurs fichiers. <br>
<br>
3- Perspective configuration : contient les vues utiles pour configurer
Jajuk (
options ) et pour cr&eacute;er ou modifier les supports. Un support est
un ensemble physique de fichiers ( comme un r&eacute;pertoire, un CD,
un baladeur ...).<br>
<br>
4- Perspective statistiques : contient des graphiques pr&eacute;sentant
votre collection : nombre de morceaux, taille des supports,
r&eacute;partition par style et taille de la collection. D'autres
statistiques seront disponibles dans les prochaines versions.<br>
<br>
5- Perspective Aide : contient les vues d'aide et '&agrave; propos'
donnant diverses informations sur le projet et sur l'environnement
d'ex&eacute;cution.<br>
<br>
<br>
<br>
</body>
</html>
