<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>






	
  
  
  
  
  
  <meta http-equiv="CONTENT-TYPE" content="text/html; charset=utf-8">






	
	
  
  
  
  
  
  
  
  
  
  
  <title>Utiliser des supports</title>
  <meta name="GENERATOR" content="OpenOffice.org 1.1.3  (Linux)">






	
  
  
  
  
  
  <meta name="CREATED" content="20050308;18045000">






	
  
  
  
  
  
  <meta name="CHANGED" content="20050427;21173100">
</head>


<body dir="ltr" lang="en-US">






<h1 lang="fr-FR">Utiliser des supports</h1>






<h2 lang="fr-FR">D&eacute;finition</h2>






<p lang="fr-FR">Jajuk joue de la musique &agrave; partir de supports.
Un support est un ensemble de fichiers audio. Cela peut &ecirc;tre : 
</p>






<ul>






	<li>
    
    
    
    
    
    <p style="margin-bottom: 0cm;" lang="fr-FR">Un r&eacute;pertoire 
	</p>






	</li>





  <li>
    
    
    
    
    
    <p style="margin-bottom: 0cm;" lang="fr-FR">Un CD-ROM de donn&eacute;es
		</p>






	</li>





  <li>
    
    
    
    
    
    <p style="margin-bottom: 0cm;" lang="fr-FR">Un disque dur externe
		</p>






	</li>





  <li>
    
    
    
    
    
    <p style="margin-bottom: 0cm;" lang="fr-FR">Un lecteur
r&eacute;seau (Netbios/Samba/NFS...). Sous Windows, utilisez des
chemins de lecteurs r&eacute;seau (comme T:\...) et non des favoris
r&eacute;seau ou des chemins UNC.</p>






	</li>





  <li>
    
    
    
    
    
    <p style="margin-bottom: 0cm;" lang="fr-FR">Un baladeur MP3. 
	</p>






	</li>





  <li>
    
    
    
    
    
    <p lang="fr-FR">Un r&eacute;pertoire distant (non impl&eacute;ment&eacute;)
		</p>






  </li>





</ul>






<p lang="fr-FR"><u>Note</u>: Dans tous les cas, except&eacute; les
r&eacute;pertoires distants, les supports sont des r&eacute;pertoires
standards du point de vue du syst&egrave;me mais Jajuk les
diff&eacute;rencie&nbsp;pour traiter les particularit&eacute;s (par
exemple, un
CD-ROM est en lecture seule) et ainsi fournir une interface graphique
adapt&eacute;e.</p>






<p lang="fr-FR">Un support contient g&eacute;n&eacute;ralement des
fichiers MP3, OGG et d'autres formats audio support&eacute;s, des
fichiers pour playlistes (ou liste de lecture) ainsi que des JPG, GIF
et autres formats images utilis&eacute;s par les pochettes.</p>






<p lang="fr-FR">Votre&nbsp;collection contient tous les&nbsp;supports que vous avez cr&eacute;&eacute;s.</p>




<h2>Cr&eacute;er et configurer les supports</h2>




<p lang="fr-FR">Les supports peuvent &ecirc;tre cr&eacute;&eacute;s soit via <span lang="fr-FR"> </span><a href="view_devices.html"><span lang="fr-FR">la vue
Supports</span></a> <span lang="fr-FR">dans la perspective
Configuration</span> soit en utilisant l'assistant support&nbsp;(Menu g&eacute;n&eacute;ral -&gt; Aide -&gt; Assistant Supports).</p>






<h2 lang="fr-FR">Rafra&icirc;chir les supports</h2>






<p lang="fr-FR">Jajuk
utilise un syst&egrave;me d'indexation automatique: les supports de
musique ne sont pas scann&eacute;s et leurs meta-donn&eacute;es ne
sont pas lues &agrave; chaque d&eacute;marrage mais Jajuk construit
une collection durant le rafra&icirc;chissement
(enregistr&eacute; sur le disque dans {r&eacute;pertoire
personnel}/.jajuk/collection.xml). Cela permet un d&eacute;marrage
rapide et la connaissance en quelques secondes de tous les fichiers
audio sur plusieurs centaines de Go de collection musicale. Cela
permet aussi de filtrer et de r&eacute;aliser de puissantes
recherches sur une collection compl&egrave;te en temps r&eacute;el.</p>
















<p>Jajuk ne reconna&icirc;t les nouveaux fichiers qu'apr&egrave;s le&nbsp;rafra&icirc;chissement du&nbsp;support:
si vous copiez un fichier sur votre disque, Jajuk en sera
inform&eacute; qu'apr&egrave;s le rafra&icirc;chissement suivant. Le
rafra&icirc;chissement est automatique et sa fr&eacute;quence est
param&eacute;trable dans&nbsp;<a href="view_devices.html"><span lang="fr-FR">la vue
Supports</span></a>. La
fr&eacute;quence par d&eacute;faut pour un disque dur (Support de type
R&eacute;pertoire) est de&nbsp;30 secs
(0.5 mins) et le scan dure en g&eacute;n&eacute;ral seulement quelques
secondes donc si vous supprimez ou ajoutez des fichiers dans ce
support, le changement sera refl&eacute;t&eacute; dans l'interface graphique
apr&egrave;s environ 30 secs. Notez que la fr&eacute;quence pour les
lecteurs r&eacute;seau est beaucoup plus importante (d&eacute;faut: 5
mins) car le scan dure plus longtemps&nbsp;(1 min ou plus pour les gros
lecteurs) et consomme de la bande passante.</p>

<p>Jajuk ne relit
pas les tags des fichiers connus. Vous pouvez le
forcer &agrave; les lire avec la fonction "Forcer le
rafra&icirc;chissement" dans l'arbre physique sur les supports ou
dans&nbsp;<a href="view_devices.html"><span lang="fr-FR">la vue
Supports</span></a> 
si vous changez les tags en utilisant une autre
application.<br>

</p>

<h2 lang="fr-FR">Monter/D&eacute;monter des supports</h2>






<p lang="fr-FR">Monter un support signifie le rendre disponible (donc
connu de Jajuk) et le d&eacute;monter signifie le d&eacute;connecter. Vous pouvez configurer
les supports dans la vue Support afin qu'ils soient automatiquement
mont&eacute;s au d&eacute;marrage. Certains supports peuvent
naturellement &ecirc;tre auto-mont&eacute;s comme par exemple un
r&eacute;pertoire depuis votre disque dur interne. D'un autre c&ocirc;t&eacute;,
nous d&eacute;courageons l'auto-montage des supports sources qui ne
sont pas "stables", c'est-&agrave;-dire les supports CD ou
les cl&eacute;s USB (par exemple), car il est probable qu'ils ne
soient plus disponibles au prochain d&eacute;marrage de Jajuk. Quand
un support requiert un montage, Jajuk va v&eacute;rifier la
disponibilit&eacute; physique de ce dernier (par exemple la pr&eacute;sence
du CD dans le lecteur) et va essayer d'y acc&eacute;der sur demande.
Sous Unix, il se peut que cela ex&eacute;cute une commande "Mount".
Si vous essayez de jouer un morceau situ&eacute; sur un support non
mont&eacute;, alors Jajuk vous demandera si vous voulez le monter.
Dans tous les cas, vous aurez un message d'erreur si le support ne
peut &ecirc;tre mont&eacute;</p>






<p><span lang="fr-FR">Vous pouvez monter ou d&eacute;monter un
support depuis la perspective physique avec les commandes "monter
ou d&eacute;monter" du menu contextuel du support s&eacute;lectionn&eacute;
ou depuis </span><a href="view_devices.html"><span lang="fr-FR">la
vue Support</span></a> <span lang="fr-FR">dans la perspective
Configuration.</span></p>






<h2 lang="fr-FR">Synchroniser les supports</h2>






<p lang="fr-FR">Lorsque on cr&eacute;&eacute; un support (voir la
documentation sur la vue p&eacute;riph&eacute;rique pour plus
d'informations), il est possible de demander &agrave; Jajuk de le
synchroniser avec un autre. Cela vous permet de copier en un simple
clic tous les nouveaux fichiers d'un support source &agrave; un
autre. Notez que vous pouvez effectuer une synchronisation partielle
en&nbsp;d&eacute;synchronisant des r&eacute;pertoires dans
la perspective Physique option Arbre Physique&nbsp;par le menu
contextuel sur le r&eacute;pertoire choisi (voir la bo&icirc;te de
s&eacute;lection en bas de la vue Information pour conna&icirc;tre la
taille r&eacute;cursivement de la s&eacute;lection). Vous pouvez
aussi effectuer des synchronisations bidirectionnelles (tous les
nouveaux fichiers d'un support sont copi&eacute;s vers l'autre) et
pas seulement unidirectionnelles. 
</p>






<p><span lang="fr-FR">Vous pouvez synchroniser deux supports depuis
la perspective physique avec la commande "Synchroniser" du
menu contextuel du support <span lang="fr-FR">s&eacute;lectionn&eacute;</span>
ou depuis </span><a href="view_devices.html"><span lang="fr-FR">La
vue Support</span></a> <span lang="fr-FR">dans la perspective
Configuration.</span></p>





<h2>Sauvegardes et restaurations<a name="backup"></a></h2>







<p>Toutes les donn&eacute;es de votre collection sont stock&eacute;es
dans le fichier collection (<span style="font-family: monospace;">{r&eacute;pertoire
personnel}/.jajuk/collection.xml</span>). Par d&eacute;faut, jajuk
cr&eacute;&eacute; des sauvegardes de cette collection&nbsp;(fichiers
<span style="font-family: monospace;">collection-{date}.xml</span>) jusqu'&agrave; occuper&nbsp;20Mo sur le
disque.
Vous pouvez param&eacute;trer la sauvegarde dans l'onglet <a href="view_parameter.html#backup">Avanc&eacute; de la vue Param&eacute;trage</a>.&nbsp;</p>







<p>Restauration: Si vous faite une erreur de manipulation et que vous
&ecirc;tes toujours dans jajuk, fermez l'application puis
&eacute;crasez le fichier&nbsp;<span style="font-family: monospace;">collection_exit.xml</span> avec le fichier
<span style="font-family: monospace;">collection.xml</span>. Si vous voulez revenir &agrave; une version plus
ancienne, &eacute;crasez le fichier <span style="font-family: monospace;">collection_exit.xml
</span>avec le fichier <span style="font-family: monospace;">collection-{date}.xml</span>
file. Red&eacute;marrez ensuite jajuk.</p>







<p>Enfin, il serait bon d'inclure votre
r&eacute;pertoire&nbsp;<span style="font-family: monospace;">{r&eacute;pertoire personnel}/.jajuk</span> dans
vos sauvegardes r&eacute;guli&egrave;res.</p>





</body>
</html>
