<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>



  
  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">


  
  
  <title>Modifier les tags et attributs</title>
</head>


<body>



<h1>Modifier les tags et attributs</h1>



<p>Il est possible de fixer des valeurs &agrave; partir:</p>



<ul>



  <li>
    
    
    <p>De la vue table logique pour les morceaux et table physique pour
les fichiers. Si vous ne voyez pas la colonne de l'attribut &agrave;
modifier, cochez la dans le s&eacute;lecteur de colonnes qui appara&icirc;t en
cliquant sur l'&icirc;cone en haut &agrave; droite du tableau (voir <a href="view_table.html#show_col">Vue table / S&eacute;lection des colonnes)</a>.&nbsp;</p>



  </li>



  <li>
    
    
    <p>De l'assistant d'attributs pour tout &eacute;l&eacute;ment (voir le paragraphe suivant).</p>



  </li>



</ul>



<h2>L'assistant d'attributs</h2>



<p>L'assistant d'attributs peut &ecirc;tre utilis&eacute; pour afficher
les modifier tous les attributs et tags d'un &eacute;l&eacute;ment
simple ou d'une s&eacute;lection d'&eacute;l&eacute;ments. Il est accessible &agrave; partir:</p>



<ul>



  <li>
    
    
    <p>Des&nbsp;vues table physique et logique&nbsp;(clic droit sur un ou plusieurs &eacute;l&eacute;ments&nbsp;-&gt;&nbsp;<span style="font-style: italic;">Attributs</span>)</p>



  </li>



  <li>
    
    
    <p>Des vues arbre physique et logiques&nbsp;(clic droit sur un ou plusieurs &eacute;l&eacute;ments&nbsp;-&gt;&nbsp;<span style="font-style: italic;">Attributs</span>)<span style="font-style: italic;"></span></p>



  </li>



  <li>
    
    
    <p>De la vue r&eacute;f&eacute;rentiel de playlistes (clic droit sur une playliste
-&gt;&nbsp;<span style="font-style: italic;">Attributs</span>).</p>



  </li>



</ul>



<p>Notes:</p>



<ul>



  <li>
    
    
    <p>Dans le cas des fichiers, sont affich&eacute;s &agrave; la fois
les attributs fichiers (cot&eacute; gauche) et les attributs morceau
associ&eacute;s (cot&eacute; droit) pour faciliter les modifications de
tags.</p>



  </li>



  <li>
    
    
    <p>Le nom des attributs personnels sont en bleu pour les diff&eacute;rentier.</p>



  </li>



  <li>Dans le cas de s&eacute;lection multiples, l'assistant
d'attributs n'affiche que les attributs pouvant &ecirc;tre
modifi&eacute;s en communs. </li>



</ul>


L'assistant d'attributs contient les colonnes suivantes:
<ul>



  <li>
    
    
    <p><span style="font-style: italic;">Nom de l'attribut</span> (attributs personnels en bleu).<span style="font-style: italic;"></span></p>



  </li>



  <li>
    
    
    <p><span style="font-style: italic;">Valeur de l'attribut</span> (modifiable ou non).</p>



  </li>



  <li>
    
    
    <p><span style="font-style: italic;">Lien</span>:
Si la valeur elle-m&ecirc;me est un &eacute;l&eacute;ment, cliquez sur
ce bouton pour afficher l'assistant d'attributs associ&eacute;.&nbsp;<span style="font-style: italic;"></span></p>



  </li>



  <li>
    
    
    <p><span style="font-style: italic;">Type</span>:
Type de l'attribut.&nbsp;<span style="font-style: italic;"></span></p>



  </li>



  <li>
    
    
    <p><span style="font-style: italic;">Album complet</span>
(seulement pour les morceaux): Si utilis&eacute;, tout changement d'une
valeur sera propag&eacute; &agrave; tous les morceaux du m&ecirc;me
album.<br>



    </p>



  </li>



</ul>


Lorsque tous les attributs sont fix&eacute;s, cliquez sur&nbsp;<span style="font-style: italic;">Appliquer</span>
pour mettre &agrave; jour les attributs et &eacute;ventuellement &eacute;crire les tags dans les fichiers musicaux.<br>



<h2>Les tags ou meta-informations</h2>



<p>Certains attributs sont &agrave; la fois stock&eacute;s dans la
collection de jajuk et dans les fichiers musicaux eux-m&ecirc;mes (via
des tags ID3 par exemple). Ces attributs sont:&nbsp;style, auteur,
album, morceau, ann&eacute;e, commentaire et numero de chanson.</p>


<p>Si vous modifiez les tags via une autre application, utiliser
l'option "Forcer la relecture des tags" et lancez un rafraichissement
du support pour prendre en compte les modifications dans jajuk (voir <a href="view_parameter.html#force_tags">Vue Parametrages / onglet tags</a>).</p>



<p>Notez que les tags sont stock&eacute;s au format&nbsp;Unicode
(UTF-16LE) dans les fichiers musicaux. Ce format est&nbsp;compatible
avec tous les lecteurs&nbsp;(Windows Media Player ou Winamp
par exemple) et permet de stocker les caract&egrave;res asiatiques. </p>



</body>
</html>
