<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>Vues et Perspectives</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.3  (Linux)">
	<META NAME="CREATED" CONTENT="20050308;18045200">
	<META NAME="CHANGED" CONTENT="20050309;8514100">
</HEAD>
<BODY LANG="en-US" DIR="LTR">
<H1 LANG="fr-FR">Vues et Perspectives</H1>
<H2 LANG="fr-FR">D&eacute;finitions</H2>
<UL>
	<LI><P LANG="fr-FR" STYLE="margin-bottom: 0cm">Jajuk est compos&eacute;
	de perspectives et de vues. Une perspective est un ensemble logique
	de vues. Par exemple, vous &ecirc;tes actuellement dans la
	perspective &quot;Aide&quot; et vous voulez afficher la Perspective
	Physique pour naviguer dans les fichiers du disque, dans les
	r&eacute;pertoires ; ou vous voulez afficher la Perspective Logique
	pour naviguer dans les styles, les auteurs, les albums ou les
	morceaux. 
	</P>
	<LI><P LANG="fr-FR" STYLE="margin-bottom: 0cm">Une vue est situ&eacute;e
	dans une perspective et affiche des informations li&eacute;es. Par
	exemple, la perspective physique contient &agrave; la fois la vue
	&quot;Arbre physique&quot; et la vue &quot;Table physique&quot;. 
	</P>
	<LI><P LANG="fr-FR" STYLE="margin-bottom: 0cm">Il y a deux types de
	vues : les vues statiques (commandes, informations, et la barre des
	perspectives) qui sont affich&eacute;es dans toutes les
	perspectives, et des vues contextuelles qui sont sp&eacute;cifiques
	&agrave; une perspective. Notez qu'une m&ecirc;me vue  peut se
	retrouver dans plusieurs perspectives (la vue &quot;Couverture&quot;
	par exemple) 
	</P>
	<LI><P LANG="fr-FR">Pour changer la perspective en cours, il faut
	cliquer sur l'ic&ocirc;ne de votre choix dans la vue &quot;S&eacute;lection
	de la Perspective&quot; (Voir Figure 02) 
	</P>
</UL>
<P><IMG SRC="../images/pav01.jpg" NAME="Image1" ALIGN=BOTTOM WIDTH=501 HEIGHT=359 BORDER=0><SPAN LANG="fr-FR"><BR><I>Fig.
01: Vues</I> </SPAN>
</P>
<P LANG="fr-FR"><B>Vues Statiques (Dans toutes les perspectives) :</B><BR>1-
Vue &quot;Commande&quot; : utilis&eacute;e pour faire des recherches,
pour contr&ocirc;ler le lecteur (stop, pause, etc.) et le son (mute,
volume). Il permet aussi de naviguer dans l'historique, de
s&eacute;lectionner le mode (r&eacute;p&eacute;ter, al&eacute;atoire)
et d'acc&eacute;der &agrave; des fonctions sp&eacute;ciales comme
'bestof'.<BR>2- S&eacute;lection de la perspective : utilis&eacute;e
pour s&eacute;lectionner la perspective courante (voir le paragraphe
suivant).<BR>3- Vue &quot;Information&quot; : affiche des
informations vari&eacute;es, la taille de la s&eacute;lection, la
qualit&eacute; du fichier audio, la position de lecture en
pourcentage 
</P>
<P LANG="fr-FR"><B>Vues contextuelles :</B><BR>4- C'est un exemple de
vue contextuelle (l'&eacute;diteur de playliste physique) que vous ne
trouverez uniquement dans la perspective Physique.</P>
<H2 LANG="fr-FR">Les perspectives de Jajuk</H2>
<P LANG="fr-FR">Jajuk contient les perspectives suivantes :</P>
<P><IMG SRC="../icons/16x16/physical_perspective.png" NAME="Image2" ALIGN=BOTTOM WIDTH=16 HEIGHT=16 BORDER=0>&nbsp;
<SPAN LANG="fr-FR">Perspective Physique : dans cette perspective,
votre collection est affich&eacute;e telle qu'elle est r&eacute;ellement
sur vos disques : fichier, r&eacute;pertoires, fichiers M3U, etc.
Toute action est ex&eacute;cut&eacute;e sur un fichier physique
donn&eacute;. Cette perspective est utile mais notez que si vous avez
plusieurs fois le m&ecirc;me morceau sur diff&eacute;rents supports
(une sur le disque dur et l'autre sur un CD), alors vous la verrez
deux fois sur toutes les vues. Il en va de m&ecirc;me pour la
playliste. </SPAN>
</P>
<P><IMG SRC="../icons/16x16/logical_perspective.png" NAME="Image3" ALIGN=BOTTOM WIDTH=16 HEIGHT=16 BORDER=0>&nbsp;
<SPAN LANG="fr-FR">Perspective Logique : dans cette perspective,
votre collection est pr&eacute;sent&eacute;e suivant les meta-donn&eacute;es
tels que les styles de musique, les auteurs, les albums, les morceaux
et les playlistes logiques (une playliste logique cartographie
plusieurs <B>playlistes m3u physiques</B>). Cette perspective est
utile dans le seul cas o&ugrave; votre collection est correctement
constitu&eacute;e. Dans le cas contraire, tout sera marqu&eacute;
comme &quot;inconnu&quot;. A l'oppos&eacute; de la playliste
physique, vous verrez des morceaux, et non des fichiers. Un morceau
correspond &agrave; un ou plusieurs fichiers. Cela signifie que vous
verrez un morceau une seule fois, m&ecirc;me si plusieurs fichiers
physiques le constituent. Si vous modifiez une playliste logique,
alors toutes les playlistes physiques associ&eacute;es (fichier .m3u)
seront &eacute;galement modifi&eacute;es.</SPAN></P>
<P><IMG SRC="../icons/16x16/player_perspective.png" NAME="Image4" ALIGN=BOTTOM WIDTH=16 HEIGHT=16 BORDER=0>&nbsp;
<SPAN LANG="fr-FR">Perspective Lecteur : utilis&eacute;e pour
afficher diverses informations pendant la lecture des morceaux : Une
vue &quot;Animation&quot; avec une zone texte tr&egrave;s large pour
afficher le nom des morceaux et deux vues pour afficher des
jaquettes. </SPAN>
</P>
<P><IMG SRC="../icons/16x16/configuration_perspective.png" NAME="Image5" ALIGN=BOTTOM WIDTH=16 HEIGHT=16 BORDER=0>&nbsp;
<SPAN LANG="fr-FR">Perspective Configuration : elle contient des vues
pour configurer Jajuk (option) et pour cr&eacute;er et modifier des
supports. Un support est un ensemble de fichiers physiques (comme un
r&eacute;pertoire sur le disque dur, un CD, un lecteur...).</SPAN></P>
<P><IMG SRC="../icons/16x16/statistics_perspective.png" NAME="Image6" ALIGN=BOTTOM WIDTH=16 HEIGHT=16 BORDER=0>&nbsp;
<SPAN LANG="fr-FR">Perspective Statistiques : elle contient
diff&eacute;rents camemberts et histogrammes sur votre collection:
nombre de morceaux, taille des p&eacute;riph&eacute;riques, la
r&eacute;partition des styles, la taille de la collection. </SPAN>
</P>
<P><IMG SRC="../icons/16x16/help_perspective.png" NAME="Image7" ALIGN=BOTTOM WIDTH=16 HEIGHT=16 BORDER=0>&nbsp;
<SPAN LANG="fr-FR">Perspective Aide : C'est la perspective que vous
&ecirc;tes en train de lire. Elle contient l'aide concernant Jajuk et
la vue &quot;A propos&quot; qui fournit plusieurs informations sur le
projet et l'environnement d'ex&eacute;cution. </SPAN>
</P>
<H2 LANG="fr-FR">Utiliser le docking</H2>
<P LANG="fr-FR">L'interface de Jajuk peut &ecirc;tre organis&eacute;e
&agrave; votre convenance: vous pouvez retailler les dimensions des
fen&ecirc;tres, (agrandir ou r&eacute;duire), d&eacute;placer une vue
et l'ajouter dans une autre vue sous la forme d'un onglet... Si vous
ne vous y retrouvez plus, restaurez les vues par d&eacute;faut en
utilisant la vue Commande Vue-&gt; Restaurer les param&egrave;tres
par d&eacute;faut. Bien s&ucirc;r, la position de vos vues et leur
configuration seront sauvegard&eacute;es quand vous fermerez Jajuk.</P>
</BODY>
</HTML>