<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>





  
  
  
  
  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">





  
  
  
  
  
  <title>Using Digital DJs</title>
</head>


<body>
<h1>Utilisation des DJs</h1>






<h2>Qu'est ce qu'un DJ num&eacute;rique ?</h2>





Un DJ num&eacute;rique est similaire &agrave; un vrai: il
g&eacute;n&egrave;re des playlistes selon des r&egrave;gles (type de
public, ambiance, transitions). Parcourir sa collection avec le mode
Al&eacute;atoire est agr&eacute;able mais pas suffisamment intelligent
pour produire une vraie programmation. L'utilisation
des DJs vous permettra de vous en affranchir&nbsp;et de la
confier &agrave; votre jukebox pr&eacute;f&eacute;r&eacute; !<br>






<h2>Qu'est ce qu'une ambiance ?</h2>





Les DJs peuvent utiliser le concept d'ambiance. Une ambiance est
simplement un groupement de styles de musique. Par exemple, l'ambiance
"Techno" peut grouper les styles&nbsp;Euro-Techno,
House, Trance et Goa. Jajuk est fourni avec des ambiances
pres&eacute;lectionn&eacute;es mais vous pouvez en
cr&eacute;er de nouvelles ou leur ajouter/enlever des styles.<br>






<h2>Types de DJs</h2>





Trois types de DJs sont actuellement disponibles: transition, proportion ou ambiance. Il ont tous des attributs en commun.<br>






<h3>Les attributs g&eacute;n&eacute;raux</h3>






<ul>
  <li>Le nom du DJ<br>





  </li>
  <li>La note minimale&nbsp;(de 1 &agrave; 4 &eacute;toiles):
sp&eacute;cifie la qualit&eacute; minimale que vous attendez des
morceaux qui vont &ecirc;tre jou&eacute;s (en se basant sur le
syst&egrave;me de notation interne). 1 signifie "pas de filtre" et 4
"seulement les meilleurs".</li>
  <li>P&eacute;riode de recouvrement&nbsp;(secondes) entre les morceaux.</li>
  <li>Unicit&eacute;: un morceau peut-il &ecirc;tre jou&eacute; plusieurs fois dans une programmation ? </li>
</ul>






<h3>Les DJs de type transition</h3>





Ce type de DJ g&eacute;n&egrave;re une playliste en utilisant des
r&egrave;gles de transition. Par exemple, vous pouvez lui demander de
jouer deux morceaux de&nbsp;[Rock ou Acoustique] puis trois morceaux de
[Jazz ou Acid]...<br>






<h3>Les DJs de type proportion</h3>





En utilisant ce type de DJ, vous pouvez sp&eacute;cifier combien de
morceaux de chaque style vous d&eacute;sirez. Par exemple, vous pouvez
lui demander de jouer&nbsp;30% de&nbsp;[Rock ou Acoustique] et 40% de
[Blues ou Folk]. Si le total est inf&eacute;rieur &agrave;&nbsp;100%,
le DJ compl&eacute;tera la s&eacute;lection avec des morceaux
al&eacute;atoires.<br>






<h3>Les DJs de type ambiance</h3>





Ce DJ tr&egrave;s simple joue les morceaux associ&eacute;s &agrave; une ambiance donn&eacute;e.
<h2>Comment utiliser les DJs ?</h2>





le point d'entr&eacute;e pour les DJ est le bouton DJ situ&eacute; dans la vue commande. <br>
<img alt="Menu DJ" src="../images/tray01.jpg"><br>






<ul>
  <li>Un simple clic sur le bouton DJ demandera au DJ par
d&eacute;faut de g&eacute;n&eacute;rer sa s&eacute;lection et de la lancer.
Notez que cette fonctionnalit&eacute; est &eacute;galement accessible
&agrave; partir du tray.</li>
  <li>Vous pouvez s&eacute;lectionner le DJ par d&eacute;faut en cliquant
sur la fl&egrave;che &agrave; cot&eacute; de l'ic&ocirc;ne et en s&eacute;lectionnant un DJ
s'il en existe. Notez que le nom du DJ s&eacute;lectionn&eacute; est disponible en tant qu'info-bulle sur le bouton.</li>
</ul>






<h2>L'assistant DJ</h2>






Ouvrez l'assistant DJ pour g&eacute;rer les DJs (cr&eacute;ation/
suppression / modification) en cliquant sur le choix "G&eacute;rer les
DJs" dans la liste d&eacute;roulante du bouton DJ.<span style="font-style: italic;"></span><span style="font-style: italic;"><br>





</span>
<h3>Cr&eacute;ation d'un DJ<br>





</h3>






<ul>
  <li>S&eacute;lectionnez "Cr&eacute;er un DJ" dans le premier &eacute;cran.</li>
  <li>S&eacute;lectionnez le mode de fonctionnement du DJ: transition, proportion ou ambiance.</li>
  <li>Saisissez&nbsp;les attributs g&eacute;n&eacute;raux.</li>
  <li>Saisissez les options sp&eacute;cifiques au mode choisi.</li>
</ul>






<h3>S&eacute;lectionner les styles pour les DJs&nbsp;transition ou proportion</h3>




Les DJs de type Transition ou&nbsp;proportion n&eacute;cessite de
s&eacute;lectionner des styles en utilisant la fen&ecirc;tre de s&eacute;lection des
styles (appara&icirc;t lors d'un clic sur un bouton). Vous pouvez
s&eacute;lectionner un ou plusieurs styles en utilisant les touches MAJ et
CTRL. Si vous d&eacute;sirez s&eacute;lectionner tous les styles d'une ambiance
existante, choisissez en une dans la liste d&eacute;roulante du haut de
la fen&ecirc;tre (Attention:
selon les styles que vous avez d&eacute;j&agrave; s&eacute;lectionn&eacute;s dans
d'autres proportions ou transitions, seuls les styles restants sont
disponibles).<br>






<h2>L'assistant d'ambiance</h2>




Cet assistant est disponible &agrave; partir de la liste
ou du bouton DJ, choix "G&eacute;rer les ambiances". Il
permet de cr&eacute;er, supprimer ou modifier les ambiances.<br>






<ul>
  <li>Utilisez le bouton "Nouvelle ambiance" pour ajouter une&nbsp;ambiance. Saisissez son nom et choisissez les styles
associ&eacute;s en utilisant la fen&ecirc;tre de s&eacute;lection. Notez qu'il
est tr&egrave;s facile de cloner une ambiance existante en la
s&eacute;lectionnant dans la liste d&eacute;roulante en haut de la
fen&ecirc;tre de s&eacute;lection de styles.</li>
  <li>Utilisez le bouton "Supprimer une ambiance" pour enlever une ambiance.</li>
  <li>Changez les styles d'une ambiance en cliquant sur le bouton des styles.</li>
</ul>





<h2>Astuces</h2>





<ul>
  <li>Renseignez l'attribut style de vos fichiers pour donner toute
la puissance &agrave; cette fonction. Vous pouvez par exemple utiliser
la fonction de cr&eacute;ation de tag CDDB pour vous aider. Lire <a href="editing.html">&Eacute;diter les tags et attributs.</a></li>
  <li>Ne fixez pas une valeur trop haute au nombre d'&eacute;toiles
d&eacute;sir&eacute;es pour le DJ si votre collection est jeune ou vous
risquez d'obtenir des playlistes tr&egrave;s courtes.</li>
  <li>Dans le cas des DJ de type proportion, n'utilisez pas de
proportions sur des ambiences contenant trop peu de morceaux ou vous
obtiendrez des playlistes tr&egrave;s courtes &eacute;galement.&nbsp;</li>
</ul>
</body>
</html>
